#include <iostream>
#include <string>
#include <windows.h>
using namespace std;

int main()
{
#define card  4
double Le = 3.00;

cout << "\n\n¿ÇÅÆ·¨À­ÀûF1³µ¶Ó2026Äê¶È×î¿ì»»Ì¥¼ÇÂ¼£º" << endl;
cout << "³µÁ¾ÂÖÌ¥:" << card << "Î»" << endl;

	Sleep(3000);
	Le-=0.78;
	cout << "2026°Ä´óÀûÑÇ£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
	
	Sleep(3000);
		Le+=0.19;
		cout << "2026ÉÏº££º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
		
		Sleep(3000);
			Le-=0.28;
			cout << "2026Ð¡ÈÕ×Ó£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
			
			Sleep(3000);
				Le+=0.18;
				cout << "2026°Í°s¹ú¼ÊÈü³µ³¡£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
				
			Sleep(3000);
				Le+=0.07;
				cout << "2026¼ª´ï£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
				
			Sleep(3000);
				Le-=0.11;
				cout << "2026Âõ°¢ÃÜ£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
				
			Sleep(3000);
				Le+=0.18;
				cout << "2026¼ÓÄÃ´ó£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
				
			Sleep(3000);
				Le+=0.66;
				cout << "2026Ä¦ÄÉ¸ç£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
				
				Sleep(3000);
					Le-=0.93;
					cout << "2026°ÍÈûÂÞÄÇ£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
					
				Sleep(3000);
					Le+=0.21;
					cout << "2026°ÂµØÀû£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
					
				Sleep(3000);
					Le-=0.18;
					cout << "2026ÒøÊ¯£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
					
				Sleep(3000);
					Le+=0.13;
					cout << "2026ÐÙÑÀÀû£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
					
				Sleep(3000);
					Le-=0.04;
					cout << "2026±ÈÀûÊ±£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
					
				Sleep(3000);
					Le-=0.07;
					cout << "2026ºÉÀ¼£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
					
				Sleep(3000);
					Le-=0;
					cout << "2026ÃÉÔú£º" << "16ºÅ³µ£¨ÏÄ¶û-ÀÕ¿ËÀ³¶û£©:" << Le << endl;
					

								
	return 0;
}
